{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Introduction to Data Science. Practice.\"\"\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Ответьте на вопросы: \n",
    "1. Какие предметные области входят в Data Science? Что между ними общего и\n",
    "в чем различие?\n",
    "Ответ:\n",
    "Data Science (DS) — это междисциплинарная область на стыке статистики, математики, \n",
    "системного анализа и машинного обучения, которая охватывает все этапы работы с данными.\n",
    " Везде работа с данными, язык программирования Python.\n",
    "2. Как вы понимаете термин «алгоритм»? Как алгоритмы связаны с блок-схемами?\n",
    "Ответ:\n",
    "Алгоритм - это строго определнноя последовательность действий. Блок-схемы - это \n",
    "способ графического обозначения алгоритма \n",
    "3 . Какую программу можно назвать хорошей? Запишите все характеристики, какие\n",
    "удастся придумать.\n",
    "Ответ:\n",
    "есть функции:\n",
    "- редактирования;\n",
    "- проверки;\n",
    "- отладки;\n",
    "- интерактивного тестирования\n",
    "4. Какой язык понимает компьютер?\n",
    "Ответ:\n",
    "Машинный язык.\n",
    "5 . Чем языки программирования отличаются от языков, на которых мы говорим?\n",
    "Ответ:\n",
    "Язык программирования - это набор команд. Компьютер воспринимает программу, преобразованную \n",
    "в машинный код, только как руководство к действию.\n",
    "Естественные языки несравнимо сложнее любых языков программирования. Человеческие языки, \n",
    "помимо передачи информации, служат еще и для выражения эмоций, кроме того контекст может \n",
    "менять смысл. Язык программирования всегда однозначен и неясности толкования не терпит.\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "1.5.2. Правда или ложь.\n",
    "1. Правда\n",
    "2. Ложь\n",
    "3. Ложь\n",
    "4. Правда\n",
    "5. Ложь\n",
    "6. Ложь\n",
    "7. Правда\n",
    "8. Ложь\n",
    "9. Правда\n",
    "10.Ложь"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "1.5.3. Практические задания\n",
    "1. Напишите алгоритм для расчета простых процентов от некоторой суммы.\n",
    "Шаг 1: Начало.\n",
    "Шаг 2: Запросить у пользователя сумму, одновременно присвоить данные переменной summ.\n",
    "Шаг 3: Запросить у пользователя размер процентов, одновременно присвоить данные \n",
    "переменной perc.\n",
    "Шаг 4: Переменной res присвоить формулу summ разделить на 100 и умножить на perc.\n",
    "Шаг 5: Вывести на экран значение res.\n",
    "Шаг 6: Конец.\n",
    "\n",
    "2. Напишите алгоритм для вычисления площади прямоугольника.\n",
    "Шаг 1: Начало.\n",
    "Шаг 2: Запросить у пользователя значение длины, одновременно присвоить данные переменной a.\n",
    "Шаг 3: Запросить у пользователя значение ширины, одновременно присвоить данные переменной b.\n",
    "Шаг 4: Переменной res присвоить формулу a умножить на b.\n",
    "Шаг 5: Вывести на экран значение res.\n",
    "Шаг 6: Конец.\n",
    "\n",
    "3 . Напишите алгоритм вычисления периметра круга.\n",
    "Шаг 1: Начало.\n",
    "Шаг 2: Запросить у пользователя значение радиуса окружности, одновременно присвоить \n",
    "данные переменной r.\n",
    "Шаг 3: Переменной res присвоить формулу 2 умножить на 3.14 и умножить на r.\n",
    "Шаг 5: Вывести на экран значение res.\n",
    "Шаг 6: Конец.\n",
    "\n",
    "4. Напишите алгоритм, который находит все простые числа меньше 100.\n",
    "Шаг 1: Начало.\n",
    "Шаг 2: Перебрать все элементы в заданом диапазоне = от 2 до 101.\n",
    "Шаг 3: Проверить для каждого числа, есть ли у него какой-либо множитель между 1 и самим собой.\n",
    "Шаг 4: Если да, то число не простое, и оно перейдет к следующему числу.\n",
    "Шаг 5: Если нет, то это простое число, и программа автоматически выведет его на экран.\n",
    "Шаг 6: Цикл автоматически прервется, когда будет достигнуто верхнее значение.\n",
    "\n",
    "\n",
    "for i in range(2, 101):\n",
    "    if i > 1:\n",
    "        for j in range(2, i):\n",
    "            if i % j == 0:\n",
    "                break\n",
    "        else:\n",
    "            print(i)\n",
    "\n",
    "5. Напишите алгоритм превращения предложения, написанного в верхнем регистре, в обычный для \n",
    "предложений регистр.       \n",
    "Шаг 1: Начало.\n",
    "Шаг 2: Присваиваем переменной с строку.\n",
    "Шаг 3: Путем среза присваиваем первую букву (под нулевым индексом) переменной first_letter.\n",
    "Шаг 5: Путем среза убираем из строки первую букву, используем метод lower.\n",
    "Шаг 6: Присваиваем переменной res зачение конкатинации переменных first_letter и с.\n",
    "Шаг 7: Выводим на печать переменную res.\n",
    "Шаг 8: Конец.\n",
    "\n",
    "c = 'Я ПОШЛА ГУЛЯТЬ'\n",
    "first_letter = c[:1]\n",
    "c = c[1:].lower()\n",
    "res = first_letter + c\n",
    "print(res)"
   ]
  }
 ],
 "metadata": {
  "language_info": {
   "name": "python"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
